Revit 2026 API

# WorksharingDisplaySettingsCanUserHaveOverrides Method

---

Checks whether a single username can have customized graphic overrides.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanUserHaveOverrides(
	string username
)
```
```vb
Public Function CanUserHaveOverrides (
	username As String
) As Boolean
```
```cpp
public:
bool CanUserHaveOverrides(
	String^ username
)
```
```fsharp
member CanUserHaveOverrides :
        username : string -> bool
```

#### Parameters

username String
     The username to check.

#### Return Value

Boolean False if the username is on the list of removed users, True otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only users that have not been removed can have overrides. Once it is removed, a username must be restored before its associated graphic overrides can be customized.

#### Reference

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace